{
    "0": [
        "What 2 kind of typing exist and how do they differ?",
        "Static typing: the data type of VARs are declared and checked at \\n\\tcompile-time. This means that the data type of the VAR is fixed during compilation, and it cannot \\n\\tchange during the exec of program. The compiler ensures that the type of VAR is correct. \\n\\tType declarations to VARs must be explicitly declared with their dt before they are used. \\n\\tFor example:\\n\\n\\tint x = 10;\\n\\tx = 'Hello'// compilation Err: incompatible types (int and String)\\n\\n\\tDynamic Typing: VARs are not fixed. The type of VAR is determined at runtime meaning that the type checking is performed during the exec of program and the VAR type can change. "
    ],
    "1": [
        "What is a compiler? ",
        "A software tool that translates source code written in a high-level programming language into machine code that can be exec directly by a computer's hardware or by another software component. The main purpose of a compiler is to help the exec of programs written in high-level, which are easier for humans to read and write, into low-level code that the computer's processor can understand and execute. "
    ],
    "2": [
        "In python what does hint typing do for python that is beneficial to the language itself?",
        "It provides hints instead of changing Python into a static typing language and aids in preventing bugs."
    ],
    "3": [
        "How to provide a VAR with two or more dt? I.e. a VAR can hold either dt. ",
        "Union[dt_1, dt_2]"
    ],
    "4": [
        "In some cases an input VAR to a fn can either be a list, tuple, or other. What is the best hint type to assign this VAR?",
        "`Iterable` which is a dt. Use this specifically if the \\n\\tVAR is going to be iterated over. "
    ],
    "5": [
        "What is a better type that can be used instead of `Union[int, None]` in which a VAR can either be int or None? ",
        "`Optional[int]` which tells devs that the VAR can hold \\n\\tint dt or none "
    ],
    "6": [
        "In complex situations it is best to define your won dt. How does the typing module provide a way to create your own type? ",
        "TypeAlias ex:\\n\\tPostsType: TypeAlias = Dict[int, str]"
    ]
}